app/controllers/records_controller.rb

  def create
    @record = Record.new(record_params)

    if @record.save
---
INSERT INTO "records" ("title", "amount", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hello"], ["amount", 45.54], ["date", "2016-10-11"], ["created_at", "2016-09-07 05:56:34.643425"], ["updated_at", "2016-09-07 05:56:34.643425"]]

  def update
    @record = Record.find(params[:id])
    if @record.update(record_params)
---
SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "records" SET "amount" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["amount", 5004.0], ["updated_at", "2016-09-09 04:21:25.431342"], ["id", 1]]

  def destroy
    @record = Record.find(params[:id])
    @record.destroy
---
SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 4]]